[
  {
    "isbn": "1",
    "title": "Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "description": "In the enchanting realm of Middle-earth, a humble hobbit named Frodo Baggins is entrusted with a perilous quest to destroy a powerful ring. As he forms an unlikely fellowship with diverse companions, they embark on an epic journey to Mordor. Along the way, they confront dark forces, forge unbreakable bonds, and discover the strength that lies within the most unexpected heroes. The narrative weaves a tapestry of friendship, sacrifice, and the timeless struggle between good and evil, set against the backdrop of a richly detailed and immersive fantasy world.",
    "priceCents": 1399,
    "coverUrl": "lord_of_rings.jpg",
    "rating": 4
  },
  {
    "isbn": "2",
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "description": "Set against the backdrop of the racially charged American South, a young girl named Scout Finch recounts the pivotal events of her childhood. Her father, Atticus Finch, a principled lawyer, defends a black man falsely accused of assaulting a white woman. The narrative explores themes of racial injustice, moral growth, and the impact of empathy. Through Scout's innocent perspective, the story unfolds with poignant lessons about compassion, morality, and the enduring struggle for justice in a society grappling with deeply ingrained prejudices.",
    "priceCents": 1199,
    "coverUrl": "to_kill_a_mockingbird.jpg",
    "rating": 3
  },
  {
    "isbn": "3",
    "title": "1984",
    "author": "George Orwell",
    "description": "In a dystopian future dominated by a totalitarian regime, the protagonist, Winston Smith, rebels against the oppressive control of Big Brother. As he navigates a world of surveillance, propaganda, and thought control, Winston becomes entangled in a forbidden love affair and a quest for truth. The narrative delves into the consequences of unchecked power, the manipulation of reality, and the erosion of individual freedoms. Through Winston's harrowing journey, the story serves as a chilling warning about the dangers of authoritarianism and the enduring quest for personal freedom.",
    "priceCents": 1099,
    "coverUrl": "1984.jpg",
    "rating": 5
  },
  {
    "isbn": "4",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "description": "Amidst the extravagance of the Roaring Twenties, the mysterious millionaire Jay Gatsby becomes infatuated with the elusive Daisy Buchanan. Narrated by Nick Carraway, a neighbor drawn into Gatsby's world, the story unravels the complexities of love, wealth, and the American Dream. Against the backdrop of opulent parties and hidden desires, the characters navigate the illusions of success and the inevitability of disillusionment. The narrative explores the gulf between appearance and reality, capturing the elusive nature of happiness in a society defined by excess and social stratification.",
    "priceCents": 1299,
    "coverUrl": "great_gatsby.jpg",
    "rating": 2
  },
  {
    "isbn": "5",
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "description": "In the magical world of wizards and witches, a young orphan named Harry Potter discovers his true heritage and destiny when he receives an invitation to Hogwarts School of Witchcraft and Wizardry. As he embarks on a journey of self-discovery, friendship, and magical adventures, Harry uncovers the dark secrets surrounding his parents' demise and the resurgence of an ancient evil. The narrative weaves a tale of courage, loyalty, and the transformative power of hope, introducing readers to a captivating world where the ordinary and the extraordinary collide.",
    "priceCents": 1499,
    "coverUrl": "harry_potter_stone.jpg",
    "rating": 4
  },
  {
    "isbn": "6",
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "description": "In the genteel society of 19th-century England, Elizabeth Bennet navigates the intricacies of love, class, and societal expectations. As she encounters the enigmatic Mr. Darcy, misunderstandings and social conventions give way to a profound and transformative romance. The narrative explores the humor and wit of Austen's characters, offering a timeless commentary on the complexities of human nature, the pursuit of happiness, and the enduring power of love that transcends societal norms.",
    "priceCents": 1299,
    "coverUrl": "pride_and_prejudice.jpg",
    "rating": 3
  },
  {
    "isbn": "8",
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "description": "Bilbo Baggins, a hobbit of comfortable habits, is thrust into an epic quest when the wizard Gandalf and a group of dwarves enlist his help to reclaim their homeland from the fearsome dragon Smaug. The narrative takes readers on a fantastical journey through Middle-earth, filled with peril, friendship, and self-discovery. Along the way, Bilbo discovers courage within himself and confronts the allure of the One Ring. J.R.R. Tolkien's classic tale weaves a tapestry of adventure, heroism, and the enduring power of the most unlikely heroes.",
    "priceCents": 1299,
    "coverUrl": "the_hobbit.jpg",
    "rating": 5
  },
  {
    "isbn": "9",
    "title": "The Da Vinci Code",
    "author": "Dan Brown",
    "description": "Renowned symbologist Robert Langdon is thrust into a gripping mystery when he becomes entangled in a quest for a hidden secret that could shatter the foundations of Christianity. As he decodes cryptic symbols and unravels ancient conspiracies, Langdon races against time to uncover the truth. The narrative weaves through art, history, and religious intrigue, keeping readers on the edge of their seats with unexpected twists and revelations. Dan Brown's thriller explores the thin line between fact and fiction, challenging perceptions and inviting readers to question established truths.",
    "priceCents": 1399,
    "coverUrl": "da_vinci_code.jpg",
    "rating": 5
  },
  {
    "isbn": "10",
    "title": "The Shining",
    "author": "Stephen King",
    "description": "Isolated in the eerie Overlook Hotel for the winter, Jack Torrance takes on the role of caretaker. As supernatural forces and the hotel's dark history begin to unravel his sanity, his family becomes ensnared in a chilling descent into madness. The narrative explores the psychological horrors of isolation, haunted spaces, and the thin line between reality and the supernatural. Stephen King's gripping tale of terror delves into the complexities of the human psyche and the haunting power of the past, creating an atmosphere of dread that lingers long after the final page.",
    "priceCents": 1299,
    "coverUrl": "the_shining.jpg",
    "rating": 4
  },
  {
    "isbn": "11",
    "title": "The Hunger Games",
    "author": "Suzanne Collins",
    "description": "In a bleak future, a reluctant participant navigates a televised spectacle where tributes engage in a fight to the death. The dystopian narrative unveils a society divided, with the Capitol orchestrating a brutal competition for control. The protagonist, thrust into this macabre pageantry, grapples with moral dilemmas, survival strategies, and the manipulation of power. Themes of rebellion, sacrifice, and the resilience of the human spirit emerge as the protagonist becomes an unwitting symbol of resistance. Suzanne Collins crafts a riveting exploration of societal control, blending action, social commentary, and emotional depth in a tale that challenges notions of authority and individual agency.",
    "priceCents": 1199,
    "coverUrl": "the_hunger_games.jpg",
    "rating": 3
  },
  {
    "isbn": "12",
    "title": "The Road",
    "author": "Cormac McCarthy",
    "description": "In a desolate post-apocalyptic world, a father and son embark on a haunting journey through ash-covered landscapes. Cormac McCarthy's sparse prose paints a stark picture of survival, love, and the struggle for humanity. The unnamed characters face existential challenges, encountering cannibals and navigating a hopeless landscape. Amidst the bleakest circumstances, McCarthy explores the enduring bond between father and son, emphasizing the power of love in the face of despair. \"The Road\" stands as a profound meditation on the human condition, offering a poignant reflection on the lengths individuals will go to preserve their humanity in a world that has lost its own.",
    "priceCents": 1299,
    "coverUrl": "the_road.png",
    "rating": 1
  },
  {
    "isbn": "13",
    "title": "The Girl with the Dragon Tattoo",
    "author": "Stieg Larsson",
    "description": "A journalist and a brilliant hacker join forces to investigate the secrets of a wealthy family, unveiling a complex mystery. Set against a backdrop of Swedish corruption, the duo unravels dark conspiracies and a decades-old disappearance. Stieg Larsson's masterful thriller combines investigative journalism, intricate characters, and relentless suspense. As the unlikely pair delves into the troubled history of the Vanger family, layers of deception and vengeance unfold. \"The Girl with the Dragon Tattoo\" is a gripping exploration of a society's shadows, where justice becomes a relentless pursuit amid the hidden complexities of family dynamics and societal intrigue.",
    "priceCents": 1399,
    "coverUrl": "dragon_tattoo.jpeg",
    "rating": 2
  },
  {
    "isbn": "14",
    "title": "The Road Not Taken and Other Poems",
    "author": "Robert Frost",
    "description": "This collection presents the timeless verses of a poetic voice, capturing the beauty of nature and the nuances of human decisions. The titular poem explores the metaphorical crossroads in life, resonating with readers through its reflections on choices and divergent paths. Robert Frost's lyrical language paints vivid images of rural landscapes, inviting contemplation on the consequences of individual decisions. Each poem contributes to an overarching theme of embracing life's uncertainties and finding meaning in the journey. Frost's verses serve as an introspective guide, encouraging readers to navigate their own roads and appreciate the profound tapestry of experiences that shape the human spirit.",
    "priceCents": 999,
    "coverUrl": "road_not_taken.jpg",
    "rating": 3
  },
  {
    "isbn": "15",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "description": "Embark on a transformative quest with a shepherd boy, guided by omens and mystical encounters across Spain and the Egyptian desert. This philosophical narrative weaves a tapestry of self-discovery, destiny, and the pursuit of dreams. The protagonist learns profound lessons about the interconnectedness of the universe and the alchemy of following one's heart. Encountering spiritual guides and unraveling the secrets of the Soul of the World, the journey becomes a metaphorical allegory. Paulo Coelho's tale resonates as a timeless exploration of personal legend, encouraging readers to embrace their destinies, recognize the extraordinary in the ordinary, and embark on a journey of self-realization.",
    "priceCents": 1199,
    "coverUrl": "the_alchemist.jpg",
    "rating": 4
  },
  {
    "isbn": "16",
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "description": "Set in a dystopian future, the novel explores a society where citizens are conditioned for conformity and happiness through technology and drugs. The story follows Bernard Marx and his journey of awakening to the darker truths of this seemingly utopian world.",
    "priceCents": 1099,
    "coverUrl": "brave_new_world.jpg",
    "rating": 5
  },
  {
    "isbn": "17",
    "title": "Rent-a-Girlfriend",
    "author": "Reiji Miyajima",
    "description": "A college student's life takes an unexpected turn when he resorts to renting a girlfriend for a family event. The temporary arrangement spins into a complex web of emotions, fake relationships, and unexpected connections, blurring the lines between rented affection and genuine feelings. As the comedy unfolds, the protagonist navigates the challenges of love, identity, and self-discovery, all while trying to keep up with the facade of a picture-perfect relationship.",
    "priceCents": 1299,
    "coverUrl": "rent_a_girlfriend.webp",
    "rating": 4
  },
  {
    "isbn": "18",
    "title": "Your Lie in April",
    "author": "Naoshi Arakawa",
    "description": "A talented young pianist, burdened by the echoes of his mother's teachings, discovers new meaning in life through an encounter with a free-spirited violinist. Their music transcends the boundaries of notes and becomes a journey of love, loss, and self-expression. As they navigate the world of competitions and personal struggles, the melody of their intertwined lives creates a poignant symphony that resonates with the colors of youth and the inevitability of change.",
    "priceCents": 1199,
    "coverUrl": "your_lie_in_april.jpg",
    "rating": 5
  },
  {
    "isbn": "19",
    "title": "Toradora!",
    "author": "Yuyuko Takemiya",
    "description": "In the chaotic realm of high school, an unlikely alliance forms between a small-statured yet fierce girl and a seemingly indifferent boy with a hidden past. As they join forces to help each other pursue their respective love interests, unexpected bonds develop, and the line between friendship and romance blurs. The journey is filled with comedic mishaps, emotional revelations, and the unpredictable nature of adolescence. Through laughter and tears, they discover the profound impact they have on each other's lives.",
    "priceCents": 1099,
    "coverUrl": "toradora.jpg",
    "rating": 4
  },
  {
    "isbn": "20",
    "title": "Ao Haru Ride",
    "author": "Io Sakisaka",
    "description": "After a chance meeting with a childhood friend she thought was lost forever, a high school girl grapples with the complexities of love, identity, and the passage of time. The once carefree friendship transforms into a delicate romance, haunted by the shadows of past misunderstandings. As they navigate the challenges of adolescence, the characters confront the bittersweet nature of first love and the profound impact it has on shaping the people they are becoming.",
    "priceCents": 1299,
    "coverUrl": "ao_haru_ride.jpg",
    "rating": 3
  },
  {
    "isbn": "21",
    "title": "Orange",
    "author": "Ichigo Takano",
    "description": "A group of friends receives letters from their future selves, warning them about a classmate's tragic fate. Determined to alter destiny, they grapple with the complexities of time, regret, and friendship. The narrative weaves between the present and a foreseen future, exploring the profound effects small actions can have on the course of a life. As the characters confront the inevitability of change, the story unfolds with a poignant exploration of love, loss, and the resilience of the human spirit.",
    "priceCents": 1199,
    "coverUrl": "orange.jpg",
    "rating": 4
  },
  {
    "isbn": "22",
    "title": "Fruits Basket",
    "author": "Natsuki Takaya",
    "description": "In a tale of family curses and hidden vulnerabilities, a high school girl stumbles upon the secrets of the mysterious Sohma family. Each member is bound by an ancient zodiac curse, turning them into animals of the Chinese zodiac when embraced by someone of the opposite gender. As bonds deepen and the girl becomes entwined in their lives, she discovers the transformative power of love, friendship, and acceptance. The story weaves humor, heartache, and the enduring strength of connections that transcend the barriers of the supernatural.",
    "priceCents": 1299,
    "coverUrl": "fruits_basket.jpg",
    "rating": 5
  },
  {
    "isbn": "23",
    "title": "Kimi ni Todoke: From Me to You",
    "author": "Karuho Shiina",
    "description": "A high school girl with an eerie resemblance to Sadako, the ghost from 'The Ring,' struggles to overcome her social isolation. When her pure intentions attract the attention of the most popular boy in class, an unexpected friendship blossoms. The narrative follows their journey through the complexities of high school relationships, misunderstandings, and the gradual unraveling of the girl's true self. As the story unfolds, it explores the transformative power of genuine connections and the courage to break free from societal expectations.",
    "priceCents": 1099,
    "coverUrl": "kimi_ni_todoke.jpg",
    "rating": 4
  },
  {
    "isbn": "25",
    "title": "Say I Love You",
    "author": "Kanae Hazuki",
    "description": "In a world where social hierarchies dictate teenage life, a reserved high school girl rejects the superficiality of popularity. When an unexpected encounter leads to an unconventional romance with the most popular boy in school, their relationship challenges societal norms and explores the genuine meaning of love. The narrative delves into themes of self-discovery, acceptance, and the transformative impact of true connection. Through the highs and lows of adolescent romance, the characters navigate the complexities of emotions, friendship, and the pursuit of genuine happiness.",
    "priceCents": 1099,
    "coverUrl": "say_i_love_you.jpg",
    "rating": 2
  },
  {
    "isbn": "26",
    "title": "Kaguya-sama: Love Is War",
    "author": "Aka Akasaka",
    "description": "In the prestigious Shuchi'in Academy, two brilliant students, the student council president and vice president, engage in a psychological battle of wits. Despite harboring romantic feelings for each other, their pride prevents them from confessing. The narrative unfolds through strategic mind games, hilarious misunderstandings, and the comical pursuit of making the other confess first. As the war of love escalates, the story explores the vulnerability beneath their competitive exteriors and the humorous complexities of teenage romance in an elite academic setting.",
    "priceCents": 1299,
    "coverUrl": "love_is_war.jpg",
    "rating": 5
  },
  {
    "isbn": "27",
    "title": "Clannad",
    "author": "Key",
    "description": "In a town where memories linger and dreams intertwine, a high school delinquent's life takes an unexpected turn when he encounters a quirky girl with a mysterious past. Together, they navigate the realms of friendship, love, and family, unlocking the healing power of human connections. As the seasons change, the story unfolds with heartwarming moments, profound grief, and the resilience of the human spirit. Through laughter and tears, the characters discover the enduring beauty found in the ordinary moments that shape our lives.",
    "priceCents": 1399,
    "coverUrl": "clannad.jpg",
    "rating": 4
  },
  {
    "isbn": "28",
    "title": "My Youth Romantic Comedy Is Wrong, As I Expected",
    "author": "Wataru Watari",
    "description": "In the cynical world of high school, a sharp-witted loner is enlisted to help his classmates with their social dilemmas. As he navigates the complexities of teenage relationships and societal expectations, his unconventional methods challenge the norms of romance and friendship. The narrative delves into the internal struggles of self-discovery, vulnerability, and the unexpected ways in which genuine connections can reshape one's perspective. Through humor and introspection, the story explores the profound impact of navigating the turbulent waters of adolescence.",
    "priceCents": 1299,
    "coverUrl": "snafu.png",
    "rating": 3
  },
  {
    "isbn": "29",
    "title": "Spice and Wolf",
    "author": "Isuna Hasekura",
    "description": "In a medieval world dominated by commerce, a traveling merchant encounters a wolf deity with a human form. Together, they embark on a journey filled with economic intrigue, complex trade schemes, and the mysteries of ancient lore. The narrative unfolds as a unique blend of romance, adventure, and economic strategy, exploring the dynamics of trust, companionship, and the interplay between the mortal and supernatural realms. As they traverse picturesque landscapes and face unexpected challenges, the characters discover the spice of life lies in the unpredictable journey itself.",
    "priceCents": 1399,
    "coverUrl": "spice_and_wolf.jpg",
    "rating": 5
  },
  {
    "isbn": "30",
    "title": "We Were There",
    "author": "Yuki Obata",
    "description": "Amidst the tumultuous years of youth, a chance encounter sparks a passionate romance between a girl harboring a painful secret and a boy with dreams of a brighter future. The narrative unfolds through the lens of their evolving relationship, capturing the highs of love and the depths of heartbreak. As they navigate the challenges of growing up and facing their own insecurities, the story explores the enduring impact of first love and the profound ways it shapes the course of their lives.",
    "priceCents": 1199,
    "coverUrl": "we_were_there.jpg",
    "rating": 2
  }
]