[
  {
    "isbn": "1",
    "title": "Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "description": "Frodo Baggins, a hobbit tasked with destroying the One Ring, a powerful artifact created by the dark lord Sauron to dominate the world. The trilogy explores themes of friendship, courage, sacrifice, and the struggle against one's own darkness.",
    "priceCents": 1399,
    "coverUrl": "lord_of_rings.jpg",
    "itemUrl": "lord_of_rings.html",
    "rating": 4
  },
  {
    "isbn": "2",
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "description": "Set in the racially charged atmosphere of the American South during the 1930s, the novel explores the moral growth of its young protagonist, Scout Finch, as her father, Atticus Finch, defends an innocent black man accused of raping a white woman.",
    "priceCents": 1199,
    "coverUrl": "to_kill_a_mockingbird.jpg",
    "itemUrl": "to_kill_a_mockingbird.html",
    "rating": 3
  },
  {
    "isbn": "3",
    "title": "1984",
    "author": "George Orwell",
    "description": "In a dystopian future, the novel explores the consequences of a totalitarian regime, led by the Party and its enigmatic leader, Big Brother. The protagonist, Winston Smith, rebels against the oppressive state and seeks truth in a world dominated by propaganda.",
    "priceCents": 1099,
    "coverUrl": "1984.jpg",
    "itemUrl": "1984.html",
    "rating": 5
  },
  {
    "isbn": "4",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "description": "Set in the Roaring Twenties, the novel depicts the decadence and excess of the Jazz Age. Through the eyes of Nick Carraway, the reader witnesses the tragic love story of Jay Gatsby and Daisy Buchanan, revealing the emptiness of the American Dream.",
    "priceCents": 1299,
    "coverUrl": "great_gatsby.jpg",
    "itemUrl": "great_gatsby.html",
    "rating": 2
  },
  {
    "isbn": "5",
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "description": "Follow the journey of a young wizard, Harry Potter, as he discovers his magical abilities and begins his education at Hogwarts School of Witchcraft and Wizardry. Together with his friends, Harry faces challenges, uncovers mysteries, and confronts the dark wizard Lord Voldemort.",
    "priceCents": 1499,
    "coverUrl": "harry_potter.jpg",
    "itemUrl": "harry_potter.html",
    "rating": 4
  },
  {
    "isbn": "6",
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "description": "In early 19th-century England, Elizabeth Bennet navigates the societal expectations of marriage while confronting the proud and enigmatic Mr. Darcy. Jane Austen's timeless novel explores love, class, and the complexities of human relationships.",
    "priceCents": 1299,
    "coverUrl": "pride_and_prejudice.jpg",
    "itemUrl": "pride_and_prejudice.html",
    "rating": 3
  },
  {
    "isbn": "7",
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "description": "Holden Caulfield, a disenchanted teenager, recounts his experiences in New York City. The novel explores themes of adolescence, alienation, and the search for authenticity in a world that often seems phony and hypocritical.",
    "priceCents": 1099,
    "coverUrl": "catcher_in_the_rye.jpg",
    "itemUrl": "catcher_in_the_rye.html",
    "rating": 4
  },
  {
    "isbn": "8",
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "description": "Bilbo Baggins, a hobbit with a penchant for comfort, is thrust into an epic adventure when he joins a group of dwarves on a quest to reclaim their homeland from the fearsome dragon Smaug. The novel serves as a precursor to the events in 'The Lord of the Rings.'",
    "priceCents": 1299,
    "coverUrl": "the_hobbit.jpg",
    "itemUrl": "the_hobbit.html",
    "rating": 5
  },
  {
    "isbn": "9",
    "title": "The Da Vinci Code",
    "author": "Dan Brown",
    "description": "Robert Langdon, a Harvard symbologist, races to solve a murder mystery that leads to a conspiracy involving ancient secrets and hidden codes. The novel takes readers on a thrilling journey through art, history, and religious symbolism.",
    "priceCents": 1399,
    "coverUrl": "da_vinci_code.jpg",
    "itemUrl": "da_vinci_code.html",
    "rating": 5
  },
  {
    "isbn": "10",
    "title": "The Shining",
    "author": "Stephen King",
    "description": "Jack Torrance, a struggling writer, accepts a job as the winter caretaker of the Overlook Hotel. As the hotel becomes snowbound, Jack's descent into madness is accelerated, and supernatural forces threaten his family. Stephen King's iconic horror novel.",
    "priceCents": 1299,
    "coverUrl": "the_shining.jpg",
    "itemUrl": "the_shining.html",
    "rating": 4
  },
  {
    "isbn": "11",
    "title": "The Hunger Games",
    "author": "Suzanne Collins",
    "description": "In a dystopian future, Katniss Everdeen volunteers to take her sister's place in the Hunger Games, a televised event where tributes fight to the death. The novel explores themes of survival, rebellion, and the consequences of power.",
    "priceCents": 1199,
    "coverUrl": "hunger_games.jpg",
    "itemUrl": "hunger_games.html",
    "rating": 3
  },
  {
    "isbn": "12",
    "title": "The Road",
    "author": "Cormac McCarthy",
    "description": "In a post-apocalyptic world, a father and son navigate a desolate landscape, facing the constant threat of starvation and violence. The novel explores themes of survival, love, and the enduring human spirit.",
    "priceCents": 1299,
    "coverUrl": "the_road.jpg",
    "itemUrl": "the_road.html",
    "rating": 1
  },
  {
    "isbn": "13",
    "title": "The Girl with the Dragon Tattoo",
    "author": "Stieg Larsson",
    "description": "Journalist Mikael Blomkvist and hacker Lisbeth Salander join forces to solve a decades-old disappearance in a wealthy Swedish family. The novel delves into corruption, intrigue, and the dark secrets hidden beneath the surface of society.",
    "priceCents": 1399,
    "coverUrl": "dragon_tattoo.jpg",
    "itemUrl": "dragon_tattoo.html",
    "rating": 2
  },
  {
    "isbn": "14",
    "title": "The Road Not Taken and Other Poems",
    "author": "Robert Frost",
    "description": "This collection features some of Robert Frost's most celebrated poems, including the iconic 'The Road Not Taken.' His verses capture the beauty of nature and the complexities of human decisions, leaving readers with profound reflections.",
    "priceCents": 999,
    "coverUrl": "road_not_taken.jpg",
    "itemUrl": "road_not_taken.html",
    "rating": 3
  },
  {
    "isbn": "15",
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "description": "Santiago, a shepherd boy, embarks on a journey to discover his personal legend and fulfill his dreams. Along the way, he encounters a series of spiritual lessons and discovers the true meaning of happiness and fulfillment.",
    "priceCents": 1199,
    "coverUrl": "the_alchemist.jpg",
    "itemUrl": "the_alchemist.html",
    "rating": 4
  },
  {
    "isbn": "16",
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "description": "Set in a dystopian future, the novel explores a society where citizens are conditioned for conformity and happiness through technology and drugs. The story follows Bernard Marx and his journey of awakening to the darker truths of this seemingly utopian world.",
    "priceCents": 1099,
    "coverUrl": "brave_new_world.jpg",
    "itemUrl": "brave_new_world.html",
    "rating": 5
  },
  {
    "isbn": "17",
    "title": "Rent-a-Girlfriend",
    "author": "Reiji Miyajima",
    "description": "Kazuya Kinoshita, heartbroken after a breakup, decides to use a rental girlfriend service. Enter Chizuru Mizuhara, his beautiful and outgoing temporary girlfriend. As their fake relationship continues, they navigate the complexities of love, jealousy, and genuine connection.",
    "priceCents": 1299,
    "coverUrl": "rent_a_girlfriend.jpg",
    "itemUrl": "rent_a_girlfriend.html",
    "rating": 4
  },
  {
    "isbn": "18",
    "title": "Your Lie in April",
    "author": "Naoshi Arakawa",
    "description": "Kōsei Arima, a former child prodigy in piano, meets the eccentric violinist Kaori Miyazono. Together, they embark on a musical journey that explores the healing power of music and the profound impact of love and loss.",
    "priceCents": 1199,
    "coverUrl": "your_lie_in_april.jpg",
    "itemUrl": "your_lie_in_april.html",
    "rating": 5
  },
  {
    "isbn": "19",
    "title": "Toradora!",
    "author": "Yuyuko Takemiya",
    "description": "Ryūji Takasu and Taiga Aisaka, two high school students with contrasting personalities, team up to help each other pursue their crushes. Along the way, they discover unexpected feelings and the complexities of teenage emotions.",
    "priceCents": 1099,
    "coverUrl": "toradora.jpg",
    "itemUrl": "toradora.html",
    "rating": 4
  },
  {
    "isbn": "20",
    "title": "Ao Haru Ride",
    "author": "Io Sakisaka",
    "description": "Futaba Yoshioka reunites with her first love, Kou Mabuchi, in high school after years of separation. As they navigate the challenges of adolescence and past regrets, they discover the impact of time on relationships.",
    "priceCents": 1299,
    "coverUrl": "ao_haru_ride.jpg",
    "itemUrl": "ao_haru_ride.html",
    "rating": 3
  },
  {
    "isbn": "21",
    "title": "Orange",
    "author": "Ichigo Takano",
    "description": "Naho Takamiya receives a letter from her future self, advising her to prevent the death of her new transfer student, Kakeru Naruse. As Naho and her friends work to change the future, they grapple with regrets, second chances, and the power of friendship and love.",
    "priceCents": 1199,
    "coverUrl": "orange.jpg",
    "itemUrl": "orange.html",
    "rating": 4
  },
  {
    "isbn": "22",
    "title": "Fruits Basket",
    "author": "Natsuki Takaya",
    "description": "Tohru Honda, an orphaned high school girl, discovers the Sohma family's secret: they turn into animals from the Chinese zodiac when hugged by the opposite sex. As she becomes entwined with their lives, she learns about love, acceptance, and breaking the cycle of the family curse.",
    "priceCents": 1299,
    "coverUrl": "fruits_basket.jpg",
    "itemUrl": "fruits_basket.html",
    "rating": 5
  },
  {
    "isbn": "23",
    "title": "Kimi ni Todoke: From Me to You",
    "author": "Karuho Shiina",
    "description": "Sawako Kuronuma, often misunderstood due to her resemblance to the horror movie character Sadako, experiences a transformation when she befriends the popular Shota Kazehaya. The series explores themes of friendship, self-discovery, and the challenges of communication.",
    "priceCents": 1099,
    "coverUrl": "kimi_ni_todoke.jpg",
    "itemUrl": "kimi_ni_todoke.html",
    "rating": 4
  },
  {
    "isbn": "25",
    "title": "Say I Love You",
    "author": "Kanae Hazuki",
    "description": "Mei Tachibana, a high school loner, begins a transformative journey when she encounters the popular Yamato Kurosawa. As they navigate the complexities of love, friendship, and self-esteem, they learn valuable lessons about connection and vulnerability.",
    "priceCents": 1099,
    "coverUrl": "say_i_love_you.jpg",
    "itemUrl": "say_i_love_you.html",
    "rating": 2
  },
  {
    "isbn": "26",
    "title": "Kaguya-sama: Love Is War",
    "author": "Aka Akasaka",
    "description": "The student council president, Kaguya Shinomiya, and vice president, Miyuki Shirogane, are deeply in love but refuse to confess their feelings, engaging in psychological battles to make the other confess first. The series combines humor, wit, and the complexities of teenage romance.",
    "priceCents": 1299,
    "coverUrl": "kaguya_sama.jpg",
    "itemUrl": "kaguya_sama.html",
    "rating": 5
  },
  {
    "isbn": "27",
    "title": "Clannad",
    "author": "Key",
    "description": "Tomoya Okazaki, a delinquent high school student, forms unexpected connections with his classmates, including the enigmatic Nagisa Furukawa. The series explores themes of family, friendship, and the profound impact of personal choices.",
    "priceCents": 1399,
    "coverUrl": "clannad.jpg",
    "itemUrl": "clannad.html",
    "rating": 4
  },
  {
    "isbn": "28",
    "title": "My Youth Romantic Comedy Is Wrong, As I Expected",
    "author": "Wataru Watari",
    "description": "Hachiman Hikigaya, a cynical loner with a pessimistic view of society, is forced to join the Service Club. Alongside two other students, he navigates the complexities of high school relationships and learns valuable lessons about empathy and understanding.",
    "priceCents": 1299,
    "coverUrl": "my_youth_romantic_comedy.jpg",
    "itemUrl": "my_youth_romantic_comedy.html",
    "rating": 3
  },
  {
    "isbn": "29",
    "title": "Spice and Wolf",
    "author": "Isuna Hasekura",
    "description": "Craft Lawrence, a traveling merchant, encounters the wolf deity Holo. Together, they embark on a journey filled with economic schemes, medieval politics, and the blossoming of a unique companionship with undertones of romance.",
    "priceCents": 1399,
    "coverUrl": "spice_and_wolf.jpg",
    "itemUrl": "spice_and_wolf.html",
    "rating": 5
  },
  {
    "isbn": "30",
    "title": "We Were There",
    "author": "Yuki Obata",
    "description": "Nanami Takahashi falls for Motoharu Yano, a popular and mysterious classmate. The series follows their tumultuous relationship through high school and beyond, exploring themes of love, loss, and the impact of past choices.",
    "priceCents": 1199,
    "coverUrl": "we_were_there.jpg",
    "itemUrl": "we_were_there.html",
    "rating": 2
  },
  {
    "isbn": "31",
    "title": "Blue Spring Ride",
    "author": "Io Sakisaka",
    "description": "Futaba Yoshioka reunites with her first love, Kou Mabuchi, in high school after years of separation. As they navigate the challenges of adolescence and past regrets, they discover the impact of time on relationships.",
    "priceCents": 1299,
    "coverUrl": "blue_spring_ride.jpg",
    "itemUrl": "blue_spring_ride.html",
    "rating": 4
  }
]